Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
##############################################################

heltec_wireless_bridge.name=Wireless Bridge

heltec_wireless_bridge.bootloader.tool=esptool_py
heltec_wireless_bridge.bootloader.tool.default=esptool_py

heltec_wireless_bridge.upload.tool=esptool_py
heltec_wireless_bridge.upload.tool.default=esptool_py
heltec_wireless_bridge.upload.tool.network=esp_ota

heltec_wireless_bridge.upload.maximum_size=3342336
heltec_wireless_bridge.upload.maximum_data_size=327680
heltec_wireless_bridge.upload.wait_for_upload_port=true
heltec_wireless_bridge.upload.flags=
heltec_wireless_bridge.upload.extra_flags=

heltec_wireless_bridge.serial.disableDTR=true
heltec_wireless_bridge.serial.disableRTS=true

heltec_wireless_bridge.build.tarch=xtensa
heltec_wireless_bridge.build.bootloader_addr=0x1000
heltec_wireless_bridge.build.target=esp32
heltec_wireless_bridge.build.mcu=esp32
heltec_wireless_bridge.build.core=esp32
heltec_wireless_bridge.build.variant=heltec_wireless_bridge
heltec_wireless_bridge.build.board=HELTEC_WIRELESS_BRIDGE

heltec_wireless_bridge.build.f_cpu=240000000L
heltec_wireless_bridge.build.flash_size=8MB
heltec_wireless_bridge.build.flash_freq=80m
heltec_wireless_bridge.build.flash_mode=dio
heltec_wireless_bridge.build.boot=dio
heltec_wireless_bridge.build.partitions=default_8MB
heltec_wireless_bridge.build.psram=
heltec_wireless_bridge.build.psram_type=qspi
heltec_wireless_bridge.build.memory_type={build.boot}_{build.psram_type}
heltec_wireless_bridge.build.defines=-D{build.band} {build.psram_val} -DMCU_ESP32_D0 -DWIRELESS_BRIDGE -DHELTEC_BOARD=4 -DRADIO_CHIP_SX127X -DSLOW_CLK_TPYE=0 -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH}  -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO}  {build.psram}

heltec_wireless_bridge.menu.CPUFreq.240=240MHz (WiFi/BT)
heltec_wireless_bridge.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wireless_bridge.menu.CPUFreq.160=160MHz (WiFi/BT)
heltec_wireless_bridge.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wireless_bridge.menu.CPUFreq.80=80MHz (WiFi/BT)
heltec_wireless_bridge.menu.CPUFreq.80.build.f_cpu=80000000L

heltec_wireless_bridge.menu.UploadSpeed.921600=921600
heltec_wireless_bridge.menu.UploadSpeed.921600.upload.speed=921600
heltec_wireless_bridge.menu.UploadSpeed.115200=115200
heltec_wireless_bridge.menu.UploadSpeed.115200.upload.speed=115200
heltec_wireless_bridge.menu.UploadSpeed.256000.windows=256000
heltec_wireless_bridge.menu.UploadSpeed.256000.upload.speed=256000
heltec_wireless_bridge.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wireless_bridge.menu.UploadSpeed.230400=230400
heltec_wireless_bridge.menu.UploadSpeed.230400.upload.speed=230400
heltec_wireless_bridge.menu.UploadSpeed.460800.linux=460800
heltec_wireless_bridge.menu.UploadSpeed.460800.macosx=460800
heltec_wireless_bridge.menu.UploadSpeed.460800.upload.speed=460800
heltec_wireless_bridge.menu.UploadSpeed.512000.windows=512000
heltec_wireless_bridge.menu.UploadSpeed.512000.upload.speed=512000


heltec_wireless_bridge.menu.PSRAM.disabled=Disabled
heltec_wireless_bridge.menu.PSRAM.disabled.build.psram_val=
heltec_wireless_bridge.menu.PSRAM.disabled.build.psram_type=qspi
heltec_wireless_bridge.menu.PSRAM.enabled=QSPI PSRAM
heltec_wireless_bridge.menu.PSRAM.enabled.build.psram_val=-DBOARD_HAS_PSRAM
heltec_wireless_bridge.menu.PSRAM.enabled.build.psram_type=qspi

heltec_wireless_bridge.menu.DebugLevel.none=None
heltec_wireless_bridge.menu.DebugLevel.none.build.code_debug=0
heltec_wireless_bridge.menu.DebugLevel.error=Error
heltec_wireless_bridge.menu.DebugLevel.error.build.code_debug=1
heltec_wireless_bridge.menu.DebugLevel.warn=Warn
heltec_wireless_bridge.menu.DebugLevel.warn.build.code_debug=2
heltec_wireless_bridge.menu.DebugLevel.info=Info
heltec_wireless_bridge.menu.DebugLevel.info.build.code_debug=3
heltec_wireless_bridge.menu.DebugLevel.debug=Debug
heltec_wireless_bridge.menu.DebugLevel.debug.build.code_debug=4
heltec_wireless_bridge.menu.DebugLevel.verbose=Verbose
heltec_wireless_bridge.menu.DebugLevel.verbose.build.code_debug=5

heltec_wireless_bridge.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_bridge.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_bridge.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_bridge.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_bridge.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_bridge.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_bridge.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_bridge.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_bridge.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_bridge.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_bridge.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_bridge.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_bridge.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_bridge.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_bridge.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_bridge.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_bridge.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_bridge.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_bridge.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_bridge.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_bridge.menu.LoRaWanDebugLevel.0=None
heltec_wireless_bridge.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_bridge.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_bridge.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_bridge.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_bridge.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_bridge.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_bridge.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_bridge.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_bridge.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_bridge.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_bridge.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_bridge.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wireless_bridge.menu.EraseFlash.none=Disabled
heltec_wireless_bridge.menu.EraseFlash.none.upload.erase_cmd=
heltec_wireless_bridge.menu.EraseFlash.all=Enabled
heltec_wireless_bridge.menu.EraseFlash.all.upload.erase_cmd=-e

#############################################################

heltec_ht_de01.name=E-Ink Driver
heltec_ht_de01.vid.0=0x303a
heltec_ht_de01.pid.0=0x1001

heltec_ht_de01.bootloader.tool=esptool_py
heltec_ht_de01.bootloader.tool.default=esptool_py

heltec_ht_de01.upload.tool=esptool_py
heltec_ht_de01.upload.tool.default=esptool_py
heltec_ht_de01.upload.tool.network=esp_ota

heltec_ht_de01.upload.maximum_size=4026368
heltec_ht_de01.upload.maximum_data_size=327680
heltec_ht_de01.upload.flags=
heltec_ht_de01.upload.extra_flags=
heltec_ht_de01.upload.use_1200bps_touch=false
heltec_ht_de01.upload.wait_for_upload_port=false

heltec_ht_de01.serial.disableDTR=false
heltec_ht_de01.serial.disableRTS=false

